www/ubuntu.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>ubuntu</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="ubuntu"/>
<meta name="generator" content="Org-mode"/>
<<<<<<< HEAD
<meta name="generated" content="2012-09-20 16:05:25 CST"/>
=======
<meta name="generated" content="2012-09-24 12:21:46 CST"/>
>>>>>>> 405e1c9d9af954e823be6a906a104be3331dab9d
<meta name="author" content="dirtysalt"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">ubuntu</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 ubuntu</a>
<ul>
<li><a href="#sec-1-1">1.1 输入法</a>
<ul>
<li><a href="#sec-1-1-1">1.1.1 切换输入法</a></li>
<li><a href="#sec-1-1-2">1.1.2 自动启动输入法</a></li>
<li><a href="#sec-1-1-3">1.1.3 google docs不能输入中文</a></li>
</ul>
</li>
<li><a href="#sec-1-2">1.2 浏览器</a>
<ul>
<li><a href="#sec-1-2-1">1.2.1 设置默认浏览器</a></li>
</ul>
</li>
<li><a href="#sec-1-3">1.3 邮件客户端</a>
<ul>
<li><a href="#sec-1-3-1">1.3.1 配置gmail</a></li>
<li><a href="#sec-1-3-2">1.3.2 thunderbird的Inbox文件过大</a></li>
</ul>
</li>
<li><a href="#sec-1-4">1.4 虚拟机</a>
<ul>
<li><a href="#sec-1-4-1">1.4.1 安装windows虚拟机</a></li>
<li><a href="#sec-1-4-2">1.4.2 windows虚拟机共享文件夹</a></li>
<li><a href="#sec-1-4-3">1.4.3 virtualbox使用U盾</a></li>
</ul>
</li>
<li><a href="#sec-1-5">1.5 外观和快捷键</a>
<ul>
<li><a href="#sec-1-5-1">1.5.1 常用快捷键</a></li>
<li><a href="#sec-1-5-2">1.5.2 调整字体大小</a></li>
</ul>
</li>
<li><a href="#sec-1-6">1.6 系统管理</a>
<ul>
<li><a href="#sec-1-6-1">1.6.1 重启机器</a></li>
<li><a href="#sec-1-6-2">1.6.2 重启unity</a></li>
<li><a href="#sec-1-6-3">1.6.3 字符界面启动</a></li>
</ul>
</li>
<li><a href="#sec-1-7">1.7 窗口管理器</a>
<ul>
<li><a href="#sec-1-7-1">1.7.1 gnome</a></li>
</ul>
</li>
<li><a href="#sec-1-8">1.8 开发和娱乐</a>
<ul>
<li><a href="#sec-1-8-1">1.8.1 amarok循环播放</a></li>
<li><a href="#sec-1-8-2">1.8.2 deb安装文件列表</a></li>
<li><a href="#sec-1-8-3">1.8.3 deb包管理</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> ubuntu</h2>
<div class="outline-text-2" id="text-1">


<p>
千万不要抱有一朝一兮就可以搞定的想法。最好的话身边有一个群体，大家都使用Ubuntu这个东西。
这样如果有什么问题的话，大家就比较容易找到解决办法，直到自己完全适应为止。
</p>

</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> 输入法</h3>
<div class="outline-text-3" id="text-1-1">

<p>安装：
</p><ul>
<li>sudo apt-get install ibus
</li>
<li>sudo apt-get install ibus-sunpinyin
</li>
<li>sudo apt-get install xsunpinyin
</li>
<li>sudo apt-get install python-xlib # 需要在emacs下面调用ibus
</li>
</ul>



</div>

<div id="outline-container-1-1-1" class="outline-4">
<h4 id="sec-1-1-1"><span class="section-number-4">1.1.1</span> 切换输入法</h4>
<div class="outline-text-4" id="text-1-1-1">

<p>在Preferences里面：
</p><ul>
<li>Input Method 里面添加 SubPinyin
</li>
<li>然后在General里面的Keyboard Shortcuts里面设置Enable or disable设置切换按键
<ul>
<li>Release+Shift_L 左边的Shift键
</li>
<li>Constrol+space control和空格键
</li>
<li>这些都和windows输入法的默认配置很像。
</li>
</ul>

</li>
</ul>

<p>TODO（dirlt）：在Emacs里面需要安装ibus.el以及ibus-agent。但是现在不知道为什么左边的Shift键在Emacs里面一直不能使用。
</p>
</div>

</div>

<div id="outline-container-1-1-2" class="outline-4">
<h4 id="sec-1-1-2"><span class="section-number-4">1.1.2</span> 自动启动输入法</h4>
<div class="outline-text-4" id="text-1-1-2">

<p>另外系统默认是不会自动启动ibus的，可以在System Settings里面的Language Support里面设置Input method为ibus
这样ibus就可以自动启动了。如果emacs需要使用ibus的话，那么ibus-daemon必须先于emacs启动。可能这样agent才能够工作。
</p>
</div>

</div>

<div id="outline-container-1-1-3" class="outline-4">
<h4 id="sec-1-1-3"><span class="section-number-4">1.1.3</span> google docs不能输入中文</h4>
<div class="outline-text-4" id="text-1-1-3">

<p>似乎sunpinyin在google docs下面工作不是很好。使用原来的pinyin就没有问题。what a shame！
</p>
</div>
</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> 浏览器</h3>
<div class="outline-text-3" id="text-1-2">

<p>安装：
</p><ul>
<li># sudo apt-get install chromium-browser # 实验性质版本
</li>
<li># sudo apt-get install google-chrome-stable # 稳定版本
</li>
<li>sudo apt-get install firefox
</li>
</ul>



</div>

<div id="outline-container-1-2-1" class="outline-4">
<h4 id="sec-1-2-1"><span class="section-number-4">1.2.1</span> 设置默认浏览器</h4>
<div class="outline-text-4" id="text-1-2-1">


<p>
System Settings =》 Details 里面可以设置默认浏览器。至于emacs里面的话可以使用如下配置。
</p>


<pre class="src src-elisp">(setq browse-url-generic-program (executable-find <span style="color: #ffff00;">"chromium-browser"</span>)
      browse-url-browser-function 'browse-url-generic)
</pre>


</div>
</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> 邮件客户端</h3>
<div class="outline-text-3" id="text-1-3">

<p>安装：
</p><ul>
<li>sudo apt-get install thunderbird
</li>
</ul>



</div>

<div id="outline-container-1-3-1" class="outline-4">
<h4 id="sec-1-3-1"><span class="section-number-4">1.3.1</span> 配置gmail</h4>
<div class="outline-text-4" id="text-1-3-1">

<ul>
<li>pop3 pop.gmail.com/pop.googlmail.com SSL/TLS 995 normal password
</li>
<li>smtp smtp.gmail.com/pop.googlmail.com SSL/TLS 465 normal password
</li>
<li>不过似乎现在thunderbird已经非常智能了，只要输入username以及email的话就可以自动进行配置了。nice！！！（现在看起来选择iamp模式也没有什么问题）
</li>
<li>server settings =&gt; 
<ul>
<li>1) leave mesages on server until I delete them. （对于imap模式来说的话，就使用默认移动到Trash下面即可）
</li>
<li>2) empty trash on exit. 
</li>
<li>3) check for new messages at startup. 
</li>
<li>4) check for new messages every 10 minutes.     
</li>
</ul>

</li>
<li>copies and folders =&gt; 1) cc these email addresses: dirtysalt1987@gmail.com（如果使用imap模式可以不使用）
</li>
<li>composition and addressing =&gt; 1) start my reply above the quote and place my signature below the quote.
</li>
</ul>


<p>
设置签名为
</p>


<pre class="example">章炎(dirtysalt)
home:http://dirlt.com
dirtysalt1987@gmail.com
</pre>


</div>

</div>

<div id="outline-container-1-3-2" class="outline-4">
<h4 id="sec-1-3-2"><span class="section-number-4">1.3.2</span> thunderbird的Inbox文件过大</h4>
<div class="outline-text-4" id="text-1-3-2">

<ul>
<li><a href="http://blog.tianya.cn/blogger/post_read.asp?BlogID=3802303&amp;PostID=35373429">http://blog.tianya.cn/blogger/post_read.asp?BlogID=3802303&amp;PostID=35373429</a>
</li>
</ul>


<p>
在安装新的操作系统时候，可能需要将原来的邮件全部迁移过去。thunderbird迁移邮件非常方便。在C:\Documents and Settings\\Application Data\Thunderbird\Profiles\wkq5wydz.default\Mail\ 下面会有你这个pop-server对应的文件，比如Inbox(对应thunderbird的收件箱),Drafts(对应thunderbird的草稿箱）等。将这些文件直接copy过去就OK了。不得不说这点非常方便：）
</p>
<p>
但是我们会遇到一个问题就是Inbox文件太大了。而且如果我们在thunderbird下面删除收件箱里面内容的话，会发现这个Inbox文件其实没有发生变化。原因是因为thunderbird采用标记删除，所以原来的邮件内容依然是保存的（也就是说如果我们通过修改Inbox里面的标记位是可以恢复的，而且这个工作不难，因为阅读Inbox的内容就会发现里面保存的文本格式。不过谨慎选用编辑器，不要将Inbox内容全部载入不然内存会爆掉的）。 <b>解决这个问题非常简单，就是在thunderbird下面针对这个文件夹右键点击压缩。对于草稿箱和其他的文件夹是一样的操作。而且在thunderbird下面有工具-&gt;选项-&gt;高级-&gt;网络&amp;磁盘空间里面，可以选择如果超过过大的话就会进行压缩。</b>
</p>
<p>
作为后端开发者，觉得thunderbird这样做是很正常的。有几种方式：
</p><ol>
<li>一种是用小碎片文件来解决，每个小碎片文件对应一个邮件，但是这样邮件太多的话性能和碎片会成为问题，但是增加和删除都非常方便
</li>
<li>另外就是使用大文件来追加写，然后针对每封邮件进行索引。索引可以保存在内存里面并且定期dump出去，启动时候检查索引是否和文件对应，不对应的话那么可能需要增量做一部分索引。但是这样删除会成为问题，标记删除可能就是最好的办法了。所以需要用户手动或者是通过程序判断磁盘文件大小来触发压缩。
</li>
<li>使用数据库本质上和2是一样的，只不过可以在一定程度上简化代码。在删除方便可能还是使用压缩删除。如果是我自己做的话那么可能考虑使用sqlite来做。单机可以embed,并且通过SQL来进行检索或者是其他操作。
</li>
</ol>


<p>
NOTE（dirlt）：其实thunderbird超过一定大小就会自动提醒是否需要压缩
</p>
</div>
</div>

</div>

<div id="outline-container-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> 虚拟机</h3>
<div class="outline-text-3" id="text-1-4">

<p>安装
</p><ul>
<li>sudo apt-get install virtualbox
</li>
<li>sudo apt-get install virtualbox-guest-additions # 设置windows虚拟机共享文件夹
</li>
</ul>



</div>

<div id="outline-container-1-4-1" class="outline-4">
<h4 id="sec-1-4-1"><span class="section-number-4">1.4.1</span> 安装windows虚拟机</h4>
<div class="outline-text-4" id="text-1-4-1">

<p>安装windows虚拟机主要是为了方便一些需要在windows下面完成的操作，比如U盾。
另外windows下面也有一些第三方的软件在Linux下面比较匮乏比如EverBox，
虽然DropBox也非常不错但是相对来说还是国内服务器会比较好一些。
</p>
<p>
使用virtualbox，通过加载windows xp的镜像安装，这个非常简单。
或者是直接使用别人生成好的.vdi文件。vdi全称应该是virtual disk image。
</p>
</div>

</div>

<div id="outline-container-1-4-2" class="outline-4">
<h4 id="sec-1-4-2"><span class="section-number-4">1.4.2</span> windows虚拟机共享文件夹</h4>
<div class="outline-text-4" id="text-1-4-2">

<p>设置共享文件夹主要是为了数据可以进行同步。通过windows虚拟机，安装同步软件比如GDrive。
然后通过共享文件夹，将GDrive的同步目录隐射到Linux文件系统上面，完成数据同步。
</p>
<ul>
<li>首先挂载VBoxAdditions.iso,这个文件在/usr/share/virtualbox下面
</li>
<li>之后就会在虚拟机里面提示安装相关的驱动程序。
</li>
<li>完成之后在设置virtualbox的settings/share folder，创建本地share folder
</li>
<li>然后进入虚拟机“我的电脑”右键选择映射网络驱动器，通过浏览可以找到对应的网络驱动器。
</li>
</ul>


<p>   
我是参考这篇图文并茂的文章的 <a href="http://hi.baidu.com/hifinan/item/79f22545a8400ed3c1a592f3">http://hi.baidu.com/hifinan/item/79f22545a8400ed3c1a592f3</a>
</p>
</div>

</div>

<div id="outline-container-1-4-3" class="outline-4">
<h4 id="sec-1-4-3"><span class="section-number-4">1.4.3</span> virtualbox使用U盾</h4>
<div class="outline-text-4" id="text-1-4-3">

<p>首先需要在 <a href="https://www.virtualbox.org/wiki/Downloads">https://www.virtualbox.org/wiki/Downloads</a> VirtualBox Extension Pack，双击执行。
在Settings =》 USB选项里面勾选 Enable USB Controller 和 Enable USB2.0（EHCI） Controller。
</p>
<p>
然后我们需要添加vboxusers这个群组，同时将自己加入到这个群组内：
</p><ul>
<li>sudo groupadd vboxusers
</li>
<li>sudo gpasswd -a dirlt vboxusers
</li>
</ul>

<p>接着重新启动ubuntu。
</p>
<p>
接着Settings =》 USB里面添加那些已经识别的设备，接着启动windows虚拟机就可以使用U盾了。
</p>
</div>
</div>

</div>

<div id="outline-container-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> 外观和快捷键</h3>
<div class="outline-text-3" id="text-1-5">


</div>

<div id="outline-container-1-5-1" class="outline-4">
<h4 id="sec-1-5-1"><span class="section-number-4">1.5.1</span> 常用快捷键</h4>
<div class="outline-text-4" id="text-1-5-1">

<ul>
<li>Ctrl+Alt+T // 打开一个terminal。
</li>
<li>Ctrl+Alt+上下左右 // 在不同的workspace之间切换。
</li>
<li>
</li>
</ul>

</div>

</div>

<div id="outline-container-1-5-2" class="outline-4">
<h4 id="sec-1-5-2"><span class="section-number-4">1.5.2</span> 调整字体大小</h4>
<div class="outline-text-4" id="text-1-5-2">

<p>System Settings =》 Universal Access里面的Seeing部分可以用来调整字体大小。但是只有等级没有具体的数字可以进行调整。
可以通过安装gnome-tweak-tool并且运行之来进行微调。
</p>
<p>
参考链接 <a href="http://ltek.dyndns.org/wordpress/?p=282">http://ltek.dyndns.org/wordpress/?p=282</a>
</p>
</div>
</div>

</div>

<div id="outline-container-1-6" class="outline-3">
<h3 id="sec-1-6"><span class="section-number-3">1.6</span> 系统管理</h3>
<div class="outline-text-3" id="text-1-6">


</div>

<div id="outline-container-1-6-1" class="outline-4">
<h4 id="sec-1-6-1"><span class="section-number-4">1.6.1</span> 重启机器</h4>
<div class="outline-text-4" id="text-1-6-1">

<p>似乎Ubuntu下面限制用户进行重启，所以要重启的话可以执行sudo reboot.
</p>
</div>

</div>

<div id="outline-container-1-6-2" class="outline-4">
<h4 id="sec-1-6-2"><span class="section-number-4">1.6.2</span> 重启unity</h4>
<div class="outline-text-4" id="text-1-6-2">

<p>unity restart &amp;
</p>
</div>

</div>

<div id="outline-container-1-6-3" class="outline-4">
<h4 id="sec-1-6-3"><span class="section-number-4">1.6.3</span> 字符界面启动</h4>
<div class="outline-text-4" id="text-1-6-3">

<ul>
<li>编辑文件/etc/default/grub
</li>
<li>GRUB_CMDLINE_LINUX_DEFAULT="quiet splash"修改成GRUB_CMDLINE_LINUX_DEFAULT="quiet splash text"
</li>
<li>运行sudo update-grub
</li>
</ul>


</div>
</div>

</div>

<div id="outline-container-1-7" class="outline-3">
<h3 id="sec-1-7"><span class="section-number-3">1.7</span> 窗口管理器</h3>
<div class="outline-text-3" id="text-1-7">


</div>

<div id="outline-container-1-7-1" class="outline-4">
<h4 id="sec-1-7-1"><span class="section-number-4">1.7.1</span> gnome</h4>
<div class="outline-text-4" id="text-1-7-1">

<p>安装：
</p><ul>
<li>gnome-shell # gnome窗口管理器
</li>
</ul>


</div>
</div>

</div>

<div id="outline-container-1-8" class="outline-3">
<h3 id="sec-1-8"><span class="section-number-3">1.8</span> 开发和娱乐</h3>
<div class="outline-text-3" id="text-1-8">

<p>安装：
</p><ul>
<li>sudo apt-get install vlc # 视频
</li>
<li>sudo apt-get install pidgin # 聊天
</li>
<li># sudo apt-get install stardict # 词典
</li>
<li>sudo apt-get install amarok # 音乐
</li>
<li>sudo apt-get install okular # pdf阅读
</li>
<li>sudo apt-get install git
</li>
<li>sudo apt-get install subversion
</li>
<li>sudo apt-get install htop
</li>
<li>sudo apt-get install dstat
</li>
<li>sudo apt-get install sysstat
</li>
<li>sudo apt-get install httperf
</li>
<li>sudo apt-get install rsync
</li>
<li>sudp apt-get install tree
</li>
<li>sudo apt-get install tcpdump
</li>
<li>sudo apt-get install clusterssh
</li>
<li>sudo apt-get install libjs-extjs
</li>
<li>sudo apt-get install libjs-extjs-doc
</li>
<li>sudo apt-get install openssh-server
</li>
<li>sudo apt-get install sqlite3
</li>
<li>sudo apt-get install eclipse
</li>
<li>sudo apt-get install python-dev
</li>
<li>sudo apt-get install libevent-dev
</li>
<li>sudo apt-get install python-gevent
</li>
<li>sudo apt-get install python-gevent-doc
</li>
<li>sudo apt-get install gunicorn
</li>
<li>sudo apt-get install recordmydesktop # 录制桌面
</li>
<li>sudo apt-get install maven2
</li>
<li>sudo apt-get install ttyload
</li>
<li>sudo apt-get install autoconf
</li>
<li>sudo apt-get install libtool
</li>
<li>sudo apt-get install automake
</li>
<li>sudo apt-get install alien
</li>
<li>sudo apt-get install dos2unix
</li>
<li>sudo apt-get install astyle
</li>
<li>sudo apt-get install valgrind
</li>
<li>sudo apt-get install mongodb
</li>
<li>sudo apt-get install python-imaging
</li>
<li>sudo apt-get install python-imaging-doc
</li>
<li>sudo apt-get install screen
</li>
<li>sudo apt-get install python-pychart
</li>
<li>sudo apt-get install python-pychart-doc
</li>
<li>sudo apt-get install python-doc
</li>
<li>sudo apt-get install python-setuptools
</li>
</ul>



</div>

<div id="outline-container-1-8-1" class="outline-4">
<h4 id="sec-1-8-1"><span class="section-number-4">1.8.1</span> amarok循环播放</h4>
<div class="outline-text-4" id="text-1-8-1">

<p>在amarok的右下角有task progression的图标，选择repeat track即可。
</p>
</div>

</div>

<div id="outline-container-1-8-2" class="outline-4">
<h4 id="sec-1-8-2"><span class="section-number-4">1.8.2</span> deb安装文件列表</h4>
<div class="outline-text-4" id="text-1-8-2">

<p>通常我们不太清楚一个deb安装了哪些文件，尤其是doc的话可能不知道放置在什么位置上面。
</p>
<p>
我们可以通过搜索引擎查找这个包，然后在 <a href="http://packages.ubuntu.com">http://packages.ubuntu.com</a> 下面找到这个包以及对应的文件列表信息。
</p>
<p>
doc存放位置通常在/usr/share/doc/&lt;package&gt;/下面。
</p>
</div>

</div>

<div id="outline-container-1-8-3" class="outline-4">
<h4 id="sec-1-8-3"><span class="section-number-4">1.8.3</span> deb包管理</h4>
<div class="outline-text-4" id="text-1-8-3">


<hr/>

<p>
<b>deb和rpm包转换</b>
</p>
<ul>
<li>安装alien
</li>
<li>rpm转deb sudo alien -d test.rpm
</li>
<li>deb转rpm sudo alien -r test.deb
</li>
</ul>


<p>
看了一下alien的help还可和下面几个包格式互转
</p><ul>
<li>slp
</li>
<li>lsb
</li>
<li>tgz
</li>
<li>pkg
</li>
</ul>


<p>
甚至可以直接调用alien -i test.rpm直接安装而不需要转换。
</p>

<hr/>

<p>
<b>安装deb</b>
</p>
<p>
sudo dpkg -i test.deb
</p>
</div>
</div>
</div>
</div>
</div>

<div id="postamble">
<<<<<<< HEAD
<p class="date">Date: 2012-09-20 16:05:25 CST</p>
<p class="creator">Org version 7.8.11 with Emacs version 24</p>
=======
<p class="date">Date: 2012-09-24 12:21:46 CST</p>
<p class="creator">Org version 7.8.02 with Emacs version 23</p>
>>>>>>> 405e1c9d9af954e823be6a906a104be3331dab9d
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
<html><body>
<script type="text/javascript">
var _bdhmProtocol = (("https:" == document.location.protocol) ? " https://" : " http://");
document.write(unescape("%3Cscript src='" + _bdhmProtocol + "hm.baidu.com/h.js%3F54a700ad7035f6e485eaf2300641e7e9' type='text/javascript'%3E%3C/script%3E"));
</script></body></html>